# 1
# p = input('Введите пароль: ')
# p1 = input('Повторите пароль: ')
#
# if p == p1:
#     print('Пароль принят')
# else:
#     print('Пароль не принят')


# 3
# g = input('Введите год: ')
# if int(g) % 4 == 0 and int(g) % 100 != 0 or int(g) % 400 == 0:
#     print('Год ' + g + ' високосный')
# else:
#     print('Это год не високосный')


# 4
k = 'красный'
s = 'синий'
h = 'жёлтый'

q = input('Введите первый цвет: ')
q1 = input('Введите второй цвет: ')


if q + q1 = k + s:
    print('фиолетовый')
elif q + q1 =

